app/Controllers/Barang.php

SELECT *
FROM `pegawai`
SELECT *
FROM `ruangan`
---
    public function create()
    {
        $data = [
            'title' => ' From Tambah Barang',
            'validation' => \config\Services::validation(),
            'pegawai' => $this->db->table('pegawai')->get()->getResultArray(),
            'ruangan' => $this->db->table('ruangan')->get()->getResultArray()