app/Controllers/Pegawai.php

    public function index()
    {
        // $this->db = \Config\Database::connect();
        $data = [
           'title' => 'Aplikasi Iventaris',
           'pegawai' => $this->db->table('pegawai')->get()->getResultArray()
---
SELECT *
FROM `pegawai`